src/Catalogs/Web1C_ИсточникДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_ИсточникДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Web1C_ИсточникДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоляФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Поля.ТекущаяСтрока;
	
	ОО = Новый ОписаниеОповещения("ПослеРедактированияФорматнойСтроки", ЭтотОбъект, ТекСтрока);
	КФС = Новый КонструкторФорматнойСтроки(Элемент.ТекстРедактирования);
	КФС.Показать(ОО);
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияФорматнойСтроки(Результат, ДопПараметры) Экспорт 
	Если Результат <> Неопределено Тогда
		СтрокаПоля = Объект.поля.НайтиПоИдентификатору(ДопПараметры);
		Если СтрокаПоля <> Неопределено Тогда
			СтрокаПоля.Формат = Результат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьПараметры(Команда)
	Объект.Параметры.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса(Команда)
	КЗ = Новый КонструкторЗапроса(Объект.ТекстЗапроса);
	ОО = Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса", ЭтотОбъект);
	
	Кз.Показать(ОО);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.ТекстЗапроса = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзЗапроса(Команда)
	ЗаполнитьИзЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзЗапросаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = Объект.ТекстЗапроса;
	
	Попытка
		ПараметрыЗапр = Запрос.НайтиПараметры();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Для каждого ПараметрЗапроса Из ПараметрыЗапр Цикл
		ИмяПараметра =  ПараметрЗапроса.Имя;
		СтрокаПараметров = Объект.Параметры.НайтиСтроки(Новый Структура("Параметр", ИмяПараметра));
		Если СтрокаПараметров.Количество() = 0 Тогда
			СтрокаПараметров = Объект.Параметры.Добавить();
			СтрокаПараметров.Параметр = ИмяПараметра;
		КонецЕсли;		
		СтрокаПараметров.Значение = ПараметрЗапроса.ТипЗначения.ПривестиЗначение(СтрокаПараметров.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоля(Команда)
	Объект.Поля.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоля(Команда)
	ЗаполнитьПоляНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляНаСервере()
	Объект.Поля.Очистить();
	
	Попытка
		//из-за временных таблиц переделал схему с построителем
		//теперь запрос формируете, а построитель выводит
		Запрос = Новый Запрос;
		
		//определяем источник запроса
		ТекстЗапроса = Объект.ТекстЗапроса;
		
		Запрос.Текст = ТекстЗапроса;
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда				
			Для Каждого СтрокаПараметров Из Объект.Параметры Цикл		
				Запрос.Параметры.Вставить(СтрокаПараметров.Параметр, СтрокаПараметров.Значение);					
			КонецЦикла;				
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Для каждого ТекКолонка Из Результат.Колонки Цикл
			НоваяСтрока = Объект.Поля.Добавить();
			НоваяСтрока.ИмяПоля = ТекКолонка.Имя;
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПредпросмотрНаСервере()
	Результат = Неопределено;
	РезультатЗапроса = Справочники.Web1C_ИсточникДанных.ВыполнитьИсточник(Объект.Ссылка);
	
	ПостроительПроверка = Новый ПостроительОтчета();
	ПостроительПроверка.ИсточникДанных = Новый ОписаниеИсточникаДанных(РезультатЗапроса);
	
	//настройка ТабДока
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	
	//настройка реквизитов построителя
	ПостроительПроверка.ОбрабатыватьПрерываниеПользователя = Истина;
	ПостроительПроверка.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительПроверка.РазмещениеИзмеренийВКолонках = ТипРазмещенияИзмерений.Вместе;
	ПостроительПроверка.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	ПостроительПроверка.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Вместе;
	ПостроительПроверка.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Вместе;
	ПостроительПроверка.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительПроверка.ЗаполнитьНастройки();
	ПостроительПроверка.Вывести(ТабДок);
	
	Результат = ПоместитьВоВременноеХранилище(ТабДок);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Предпросмотр(Команда)
	Адрес = ПредпросмотрНаСервере();
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ТабДок = ПолучитьИзВременногоХранилища(Адрес);
		//ТабДок = Новый ТабличныйДокумент;
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры
